ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-python.autopep8
ms-python.black-formatter
njpwerner.autodocstring
mhutchie.git-graph
visualstudioexptteam.vscodeintellicode
ms-azuretools.vscode-docker
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-wsl
ms-ceintl.vscode-language-pack-ja
bierner.markdown-mermaid